PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
/**
 * @file sio_serialIO.c
 * Support of the LINFlex 2 device of the MPC5748G for serial text I/O. The device is
 * configured as UART and fed by DMA. We get a serial RS 232 output channel of high
 * throughput with a minimum of CPU interaction. It can be used by all three cores.\n
 *   Input is done by interrupt on a received character. The bandwidth of the input channel
 * is by far lower than the output. This is fine for the normal use case, controlling an
 * application by some input commands, but would become a problem if the intention is to
 * download large data amounts, e.g. for a kind of boot loader.\n
 *   Note, serial input is possible only from one core. Which core, is a compile time
 * configuration, see #INTC_IRQ_TARGET_CORE. Using the techniques from the implementation
 * of serial output for serial input, too, it would be possible to permit multi-core access
 * but it must be doubted that a reasonable use case exists and the implementation would
 * inherit the involved disadvantages (see sio_osWriteSerial() for details).\n
 *   The API is a small set of basic read and write routines, which adopt the conventions
 * of the C standard library so that the C functions for formatted output become usable.\n
 *   Note, the binding to the formatted output functions of the C library is not part of
 * this module.\n
 *   Note, formatted input is not possible through C standard functions.
 * 
 * @todo Doc allocated devices: LINFLex, SIUL, DMA, DMAMUX, PBridge, PIT, input interrupt
 * on which core
 *
 * Copyright (C) 2017-2021 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   sio_osInitSerialInterface
 *   sio_scFlHdlr_writeSerial
 *   sio_writeSerial (inline)
 *   sio_osWriteSerial
 *   sio_osGetChar
 *   sio_osGetLine
 * Local functions
 *   configPeripheralBridgeForDMA
 *   configSIULForUseWithOpenSDA
 *   configPITAsDMATrigger
 *   stopDMATrigger
 *   startDMATrigger
 *   configDMA
 *   configLINFlex
 *   linFlexRxInterrupt
 *   registerInterrupts
 */

/*
 * Include files
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "rtos.h"
#include "dma_dmaDriver.h"
#include "sio_serialIO.h"
#include "sio_serialIO_defSysCalls.h"
#include "mtx_mutex.h"



/*
 * Defines
 */
 
/** The MPC has 18 LINFlex devices. The code is not specific for a certain device but not
    optimal for of all them, neither. The devices 0 and 1 can communicate with the DMA and
    could be run more optimal than implemented in this module, which has been made mainly
    for LINFlexD_2, which has no direct handshake with the DMA.\n
      Possible is the assignment of 0 .. 17.
      @remark With the DEVKIT-MPC5748G evaluation board the device LINFlexD_2 is the
    preferred choice. This device is connected to the host machine through USB and can be
    used with a terminal software on the host without any additional hardware or wiring.
      @remark Setting this define to a value other than 2 has never been tested. */
#define IDX_LINFLEX_D 2

/** The DMA channel to serve the UART with sent data bytes. Since most of the LINFlex
    devices are not connected to the DMA we need to use a timer triggered channel. This
    limits the choice of DMA channels to 0, 1, 16 and 17. By default we use 0, the one out
    of this set with lowest standard priority.
      @remark The DMA is triggered by a timer. The choice of the DMA channel implies the
    choice of a particular timer at the same time. This is: PIT 0, 1, 4, 5 for DMA 0, 1,
    16, 17, respectively. This timer needs to be available. */
#define DMA_CHN_FOR_SERIAL_OUTPUT   0

/** The interrupt priority for serial input. The interrupt is requested by the UART when
    another byte has been received. The range is 1..15.
      @remark The chosen priority needs to be greater than the priority of any context,
    that makes use of the input related API functions of this module. */
#define INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT     5u

/** In principal, all cores can serve the on-character-received interrupt. Here, we chose,
    which one is in charge. The range is 0 (Z4A), 1 (Z4B) or 2 (Z2). */
#define INTC_IRQ_TARGET_CORE    0

/** The size of the ring buffer for serial output can be chosen as a power of two of bytes.
      @remark The permitted range of values depends on the reservation of space made
    in the linker control file. The macro here needs to be maintained in sync with the
    symbol ld_noBitsDmaRingBuffer, that is maintained in the linker file. */
#define SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO   10

/** The size of the ring buffer for serial input as number of bytes. The maximum capacity
    is one Byte less than the size. For this buffer, there's no penalty in not using a
    power-of-two size. */
#define SERIAL_INPUT_RING_BUFFER_SIZE   257

/** The default behavior of terminal programs is to send a CR at the end of a message. By
    configuration, this can also be a pair of CR and LF. For serial input, this module
    handles this by compile time settings. Each of the two characters can be configured to
    be understood as end of line and the other one can be filtered out. If it is not
    filtered out then it behaves like any ordinary character, it becomes part of the read
    message that is passed on to the application.\n
      Here we have the end of line character. Should normally be carriage return but may
    also be the linefeed. Which one can depend on the terminal software you use.\n
      Note, for serial output, this module doesn't handle EOL at all. */
#define SERIAL_INPUT_EOL    '\r'

/** See #SERIAL_INPUT_EOL for an explanation. Here we have a character to be filtered out
    from the input stream. Should normally be the other one as configured for
    #SERIAL_INPUT_EOL. Filtering inactive is expressed by '\0' (but the zero byte is not
    filtered). */
#define SERIAL_INPUT_FILTERED_CHAR  '\n'

