PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
/** Compute the size of the output ring buffer as number of bytes. */
#define SERIAL_OUTPUT_RING_BUFFER_SIZE  (1u<<(SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO)) 

/** Used for index arithemtics: A mask for the index bits in an integer word. Here for the
    serial output buffer. */
#define SERIAL_OUTPUT_RING_BUFFER_IDX_MASK  (SERIAL_OUTPUT_RING_BUFFER_SIZE-1)


/* The LINFlex device to be used is selected by name depending on the setting of
   #IDX_LINFLEX_D. */
#if IDX_LINFLEX_D >= 0  &&  IDX_LINFLEX_D <= 17
# define LINFLEX_BY_IDX(idx)                                                            \
                ((LINFlexD_Type*)((((idx)&0x1u)==0? LINFlexD_0_BASE: LINFlexD_1_BASE)   \
                                  + ((idx)>>1u)*(LINFlexD_2_BASE-LINFlexD_0_BASE)       \
                                 )                                                      \
                )
# define LINFLEX LINFLEX_BY_IDX(IDX_LINFLEX_D)
#else
# error Invalid configuration, unknown LINFlex device specified
#endif

/* Direct Memory Access Multiplexer (DMAMUX), RM, section 71, p. 3563: The DMA is
   triggered to do a minor loop cycle by the data request of some I/O device.
   Unfortunately is the LINFlex device on the DEVKIT-MPC5748G that is connected to the
   USB port not capable of triggering a DMA transfer on buffer empty. We control the speed
   of the data transmission by a timer based trigger condition. This technique is
   restricted to the first two DMA channels of each group. Here, we select the related
   timer. */
#if DMA_CHN_FOR_SERIAL_OUTPUT >= 0  &&  DMA_CHN_FOR_SERIAL_OUTPUT <= 1
# define PIT_TIMER_CHN_IDX (DMA_CHN_FOR_SERIAL_OUTPUT)
#elif DMA_CHN_FOR_SERIAL_OUTPUT >= DMAMUX_CHCFG_COUNT \
      &&  DMA_CHN_FOR_SERIAL_OUTPUT <= DMAMUX_CHCFG_COUNT+1
# define PIT_TIMER_CHN_IDX ((DMA_CHN_FOR_SERIAL_OUTPUT)-(DMAMUX_CHCFG_COUNT)+4u)
#else
# error Configuration error: The chosen DMA channel does not permit timer triggering
#endif


/*
 * Local type definitions
 */
 
 
/*
 * Local prototypes
 */
 
 
/*
 * Data definitions
 */
 
/** This development support variable counts the number of DMA transfers intiated since
    power-up, to do the serial output */
volatile unsigned long SBSS_OS(sio_serialOutNoDMATransfers) = 0;

/** The ring buffer for serial output can be momentarily full. In such a case a sent
    message can be truncated (from a few bytes shortend up to entirely lost). This
    development support variable counts the number of messages since power-up, which
    underwent trunction.
      @remark Because of the race conditions between serial I/O interrupt and application
    software can not clearly relate a change of \a sio_serialOutNoTruncatedMsgs to a
    particular character or message it sends with sio_osWriteSerial(). In particular, it must
    not try to reset the counter prior to a read operation in order to establish such a
    relation. The application will just know that there are garbled messages. */
volatile unsigned long SBSS_OS(sio_serialOutNoTruncatedMsgs) = 0;

/** The ring buffer for serial output can be momentarily full. In such a case a sent
    message can be truncated (from a few bytes shortend up to entirely lost). This
    development support variable counts the number of truncated, lost message characters
    since power-up.
      @remark See \a sio_serialOutNoTruncatedMsgs for race conditions with the output
    functions of this module's API. Just the same holds for \a
    sio_serialOutNoLostMsgBytes. */
volatile unsigned long SBSS_OS(sio_serialOutNoLostMsgBytes) = 0;

/** The ring buffer used for the DMA based serial output.
      @remark The size of the buffer is defined here in the C source code but there is a
    strong dependency on the linker control file, too. The log2(sizeOfBuffer) least
    significant bits of the buffer address need to be zero. The buffer address (and thus
    its alignment) is specified in the linker file, which therefore limits the maximum size
    of the buffer. */
static uint8_t _serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE]
                                                        SECTION(.sio_bss._serialOutRingBuf);

/** The write index into the ring buffer used for serial output. Since we use bytes and
    since the log2(sizeOfBuffer) least significant bits of the buffer address are zero
    the address of the index element is \a _serialOutRingBuf | \a _serialOutRingBufIdxWrM,
    which is equal to \a _serialOutRingBuf + \a _serialOutRingBufIdxWrM.
      @remark The variable is only used modulo SERIAL_OUTPUT_RING_BUFFER_SIZE, i.e. the more
    significant bits don't care (but aren't necessarily zero). This is indicated by the M
    at the end of the name. */
static volatile unsigned int SBSS_OS(_serialOutRingBufIdxWrM) = 0;

/** The ring buffer used for the interrupt based serial input. No particular section is
    required. Due to the low performance requirements we can use any location and do normal
    address arithmetics. */
static volatile uint8_t BSS_OS(_serialInRingBuf)[SERIAL_INPUT_RING_BUFFER_SIZE];

/** A pointer to the end of the ring buffer used for serial input. This pointer facilitates
    the cyclic pointer update.
      @remark Note, the pointer points to the last byte in the buffer, not to the first
    address beyond as usually done. */
static volatile const uint8_t * _pEndSerialInRingBuf =
                                    &_serialInRingBuf[SERIAL_INPUT_RING_BUFFER_SIZE-1];

/** The pointer to the next write position in the ring buffer used for serial input. */
static volatile uint8_t * volatile SDATA_OS(_pWrSerialInRingBuf) = &_serialInRingBuf[0];

/** The pointer to the next read position from the ring buffer used for serial input. The
    buffer is considered empty if \a _pWrSerialInRingBuf equals \a _pRdSerialInRingBuf,
    i.e. the buffer can contain up to SERIAL_INPUT_RING_BUFFER_SIZE-1 characters. */
static volatile uint8_t * volatile SDATA_OS(_pRdSerialInRingBuf) = &_serialInRingBuf[0];

/** The number of received but not yet consumed end of line characters. Required for read
    line API function. */
static volatile unsigned int SBSS_OS(_serialInNoEOL) = 0;

/** The number of lost characters due to overfull input ring buffer. */
volatile unsigned long SBSS_OS(sio_serialInLostBytes) = 0; 

#ifdef DEBUG
/** Count all characters received since last reset. This variable is supported in DEBUG
    compilation only. */
volatile unsigned long SBSS_OS(sio_serialInNoRxBytes) = 0;
#endif

/** The handle of the DMA channel, which serves the serial device. */
static dma_dmaChannel_t DATA_OS(_hDMAChannel) = DMA_DMA_CHANNEL_UNINITIALIZED_OBJ;


