PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
/*
 * Function implementation
 */

/**
 * After reset, the peripheral bridges are closed for DMA. We set the master privileges in
 * bridge A for DMA such that it has read and write access in user and supervisor mode. The
 * default settings for the I/O device related slots (including the required LINFlex 2) are
 * such that now all devices behind bridge A. Bridge B is not touched.
 */
static void configPeripheralBridgeForDMA(void)
{
    /* Extend master priviledges of bridge A such that DMA gets full access.
         Note, read access is granted for generality (safety is not a design goal of this
       sample application), we would only require write access to the device. */
    AIPS_A->MPRA |= AIPS_MPRA_MTR4(1)   /* Allow read access to DMA. */
                    | AIPS_MPRA_MTW4(1) /* Allow write access to DMA. */
                    | AIPS_MPRA_MPL4(1);/* Allow supervisor access to DMA. */

} /* End of configPeripheralBridgeForDMA */


/**
 * Initialize the external pin mapping such that the device LINFlexD_2 can be used without
 * additional hardware or wiring for the serial communication with the openSDA chip on the
 * DEVKIT-MPC5748G evaluation board.\n
 *   Other pin mappings are not supported. Each LINFlexD device has its own pins and
 * usually there are even more than one choices per device. If the code is run with another
 * device or on another board it depends which pins to be used. This cannot be anticipated
 * by the code offered here.
 */
static void configSIULForUseWithOpenSDA(void)
{
    /* This pin configuration is only useful if LINFlexD_2 is configured. */
    assert(IDX_LINFLEX_D == 2);
    
    /* The configuration of in- and output pins is documented in the Excel workbook
       IO_Signal_Description_and_Input_Multiplexing_Tables.xlsx; which is embedded into the
       MCU reference manual PDF file. In Acrobat Reader, click View/Show/Hide/Navigation
       Panes/Attachments to find the Excel workbook.
         In the Excel workbook, on worksheet "IO Signal Table", each line refers to one of
       the possible functions of a port. The port is found in column A and most relevant
       are the settings "SIUL MSCR#" in column B, first line in the area of the given port,
       and "MSCR SSS" in column C. They designate the index of the MSCR register to use and
       the source selection, which is a major field of this register.
         The port has a fixed, hardwired, however chip-housing dependent one-by-one
       relation with a pin. This relation is found in columns O, P and Q.
         The source selection relates to the connection from an I/O device to the output
       buffer of the port. To connect an input of an I/O device with a port, a second
       source selection needs to be made, usually a port/pin but in a few cases is an
       alternate, internal device a possible source, too. (See RM 15.2.11, p. 388 and
       figure 15-2 on next page.) This requires the setting of field "IMCR SSS" in the
       other register array IMCR[]. The index into IMCR[] is found by search in the other
       worksheet "Input Muxing". Look for the port in question in column H or for the
       device to connect in column C. Column D holds the appropriate index into IMCR[].
         Note, the reference from worksheet "IO Signal Table" to worksheet "Input Muxing"
       is made by index of IMCR, too. In worksheet "IO Signal Table", in the sub-ordinated
       lines inside the area of the given port, column C, there is a second index stated
       for the input functions of a port. This index can be found in worksheet "Input
       Muxing" in column E in the line, we are looking for. For unclear reasons, this index
       plus 512 seems to be the index into the IMCR[] register array, too. For inputs, if
       we take worksheet "IO Signal Table", columns C and D, we could program IMCR.SSS
       without refering to the other worksheet. */
    SIUL2->MSCR[40 /* PC8 */] =
                SIUL2_MSCR_SSS(1)   /* Source signal is LIN2TX */
                | SIUL2_MSCR_SRC(3) /* Slew rate: Full drive without SR control */
                | SIUL2_MSCR_OBE(1) /* Enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(0) /* Disable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;
    SIUL2->MSCR[41 /* PC9 */] =
                SIUL2_MSCR_SSS(0)   /* Source signal for (disabled) ouput is default */
                | SIUL2_MSCR_SRC(0) /* Slew rate: Irrelevant for input */
                | SIUL2_MSCR_OBE(0) /* Enable output buffer */
                | SIUL2_MSCR_ODE(0) /* Disable open drain, drive both edges */
                | SIUL2_MSCR_SMC(1) /* Safe mode as after reset */
                | SIUL2_MSCR_APC(0) /* No analog I/O */
                | SIUL2_MSCR_IBE(1) /* Enable input buffer */
                | SIUL2_MSCR_HYS(1) /* Hysteresis as after reset */
                | SIUL2_MSCR_PUE(0) /* Pull up/down is disabled */
                | SIUL2_MSCR_PUS(0) /* Pull up/down doesn't care, is disabled */
                ;
   /* Conenct the LINFlexD_2 device with the input buffer of port PC9. */
   SIUL2->IMCR[202 /* LIN2RX */] = SIUL2_IMCR_SSS(2);/* 2: IO_PAD PC9 */

} /* End of configSIULForUseWithOpenSDA */



/**
 * Most of the LINFlexD devices can't themselves request DMA transfers on TX buffer not full
 * or RX buffer not empty. Instead, we use a regular timer tick to trigger the DMA. This is
 * possible since the timing of the UART is strictly regular. The character transmission
 * time is fixed and known and we can trigger the DMA quite accurate. However, we need of
 * course a small safety margin and can't exploit the serial bandwidth as much as it is
 * possible with the few DMA capable UART devices.
 *   @param baudRate
 * The Baud rate in Hz. Allow values range from 10 .. 1000000, proven values range from 300
 * till 115200 Hz.
 *   @remark
 * To match the correct Baud rates the code assumes a peripheral clock rate of 40 MHz for
 * the PIT timers.
 */
static void configPITAsDMATrigger(unsigned int baudRate)
{
    /* Disable timers during configuration. RM, 51.4.1, p. 2731. */
    PIT->MCR |= PIT_MCR_MDIS(1);

    /* The timer's cycle time is the rate of requesting a minor loop at the DMA. A minor
       loop is configured to be a single character. We need to match the character send
       time but need to consider a small margin - there's no handshake between DMA and
       LINFlexD and only by waiting long enough we can be sure that the UART is capable of
       taking the next character.
         The peripheral clock has been initialized to 40 MHz. The timer counts at this
       rate. 
         T_char = (8 payload bits + 1 start bit + 1 stop bit + 1 margin bit) / baudRate
         Counts/cycle = T_char / (1/f_clk) = f_clk / baudRate * 11
         We round the counts upwards in order to not endanger our margin.
         -1: See RM, 51.6 */
    const uint32_t PIT_clk = 40000000u
                 , countsPerCycle = (11*PIT_clk + baudRate-1) / baudRate;
    PIT->TIMER[PIT_TIMER_CHN_IDX].LDVAL = countsPerCycle-1;
    
    /* Enable timer operation again */
    PIT->MCR &= ~PIT_MCR_MDIS_MASK;
    
