PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
    /* Clear possibly pending interrupt flags. */
    PIT->TIMER[PIT_TIMER_CHN_IDX].TFLG = PIT_TFLG_TIF(1);
    
    /* Don't enable interrupts by the timer and keep it still stopped. CHN: No chaining.
       See RM 51.4.10. */
    PIT->TIMER[PIT_TIMER_CHN_IDX].TCTRL = PIT_TCTRL_CHN(0)
                                          | PIT_TCTRL_TIE(0)
                                          | PIT_TCTRL_TEN(0);
} /* End of configPITAsDMATrigger */



/**
 * Halt the PIT timer, which triggers each DMA transfer of a single character from memory
 * to UART. Use startDMATrigger() the re-start the timer again.
 */
static inline void stopDMATrigger(void)
{
    /* See RM 51.4.10. */
    PIT->TIMER[PIT_TIMER_CHN_IDX].TCTRL = PIT_TCTRL_CHN(0)   /* No chaining of timers. */
                                          | PIT_TCTRL_TIE(0) /* No interrupts needed. */
                                          | PIT_TCTRL_TEN(0);/* Disable the timer channel. */

} /* End of stopDMATrigger */



/**
 * (Re-)start the PIT timer, which triggers each DMA transfer of a single character from
 * memory to UART. May be used after initialization with configPITAsDMATrigger() or after
 * the use of stopDMATrigger().
 */
static inline void startDMATrigger(void)
{
    /* See RM 51.4.10. */
    PIT->TIMER[PIT_TIMER_CHN_IDX].TCTRL = PIT_TCTRL_CHN(0)   /* No chaining of timers. */
                                          | PIT_TCTRL_TIE(0) /* No interrupts needed. */
                                          | PIT_TCTRL_TEN(1);/* Enable the timer channel. */

} /* End of startDMATrigger */




/**
 * Initialize the DMA device. The chosen channel is set up to write the contents of a
 * cyclic buffer of fixed address and size into the UART.
 *   @remark
 * The DMA initialization is mostly related to the DMA channel in use (which is considered
 * globally reserved for this purpose). However, this function accesses some DMA registers,
 * too, that affect all channels (e.g. channel arbitration). This function will require
 * changes, when the module is integrated into an environment, where different DMA channels
 * are applied for different, unrelated purposes.
 */
static void configDMA(void)
{
    /* Check preconditions for use of DMA with modulo source addressing. If this assertion
       fires it may point to a inconsistency between the C source code and the linker
       control file, which provides the address of the buffer. */
    assert(((uintptr_t)_serialOutRingBuf & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK) == 0);
    
    /* The linker script is required to provide a properly aligned buffer without risking
       to loose lots of RAM because of the alignment. Therefore, the linker script itself
       has a constant for the size of the buffer. We need to double check the consistency
       of linker configuration with C code. */
    extern uint8_t ld_noBitsDmaRingBuffer[0] ATTRIB_DBG_ONLY;
    assert((uintptr_t)ld_noBitsDmaRingBuffer == SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO);

    /* Initialize write to ring buffer. */
    _serialOutRingBufIdxWrM = 0;

    static const dma_dmaTransferCtrlDesc_t RODATA(dmaChnCfg) =
    {
        /* Source address of data is set below; this requires a non-const expression. */
        .SADDR = 0u,

        /* SMOD: Source modulo feature is applied to implement the ring buffer.
           SSIZE: Read 1 byte per transfer.
           DMOD: Destination modulo feature is not used.
           DSIZE: Write 1 byte per transfer. */
        .ATTR = DMA_TCD_ATTR_SMOD(SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO)
                | DMA_TCD_ATTR_SSIZE(0u /* 0..3, 5: 2^n Byte */)
                | DMA_TCD_ATTR_DMOD(0u) /* 0: No modulo for destination */
                | DMA_TCD_ATTR_DSIZE(0u /* 0..3, 5: 2^n Byte */),

        /* After transfer, add 1 to the source address. */
        .SOFF = DMA_TCD_SOFF_SOFF(1),

        /* Transfer 1 byte per minor loop */
        .NBYTES.MLNO = DMA_TCD_NBYTES_MLNO_NBYTES(1u),

        /* After major loop, do not move the source pointer. Next transfer
           will read from next cyclic address. */
        .SLAST = DMA_TCD_SLAST_SLAST(0),

        /* Load address of destination is fixed. It is the byte input of the UART's FIFO. */
        .DADDR = DMA_TCD_DADDR_DADDR((__IO uint32_t)&LINFLEX->BDRL + 3u),

        /* Initialize the beginning and current major loop iteration counts to zero. We
           will set it in the next call of sio_osWriteSerial. */
        .CITER.ELINKNO = DMA_TCD_CITER_ELINKNO_CITER(0u) | DMA_TCD_CITER_ELINKNO_ELINK(0u),

        /* After transfer, do not alter the destination address. */
        .DOFF = DMA_TCD_DOFF_DOFF(0),

        /* After major loop, do not alter the destination address. */
        .DLASTSGA = DMA_TCD_DLASTSGA_DLASTSGA(0),

        /* The counter reload value for the major loops needs to be initialized identical
           to CITER to avoid a configuration error. See RM 70.3.35. */
        .BITER.ELINKNO = DMA_TCD_CITER_ELINKNO_CITER(0u) | DMA_TCD_CITER_ELINKNO_ELINK(0u),

        /* TCD Control and Status (DMA_TCDn_CSR), see RM 70.3.36, p. 3538.
             BWC: No stalling, 3: Stall for 8 cycles after each major cycle (i.e. after
           each character); fast enough for serial com.
             MAJORLINKCH: Index of other channel to start after major loop if channel
           linking is enabled.
             DONE: Will be set on completion and should be zero but we better clear it.
             MAJORLINKCH: Index of other channel to start after major loop if channel
           linking is enabled. It's a don't care as channel linking is off.
             ESG: Enable scatter/gather mode, i.e. dynamic linkage of TCDs through memory
           pointers. 0 is off.
             DREQ: Do a single major transfer loop; don't repeat, don't link to other
           channels. 1: Disable DMA transfer request at the end of the major loop. 0: Don't
           disable it.
             INTHALF: Generate interrrupt when major loop is half way done.
             INTMAJOR: Generate interrrupt when major loop has completed.
             Start: Initiate the DMA transfer specified by this TCD by SW. The flag is
           reset by HW as soon as the trigger command has been accepted. */
        .CSR = DMA_TCD_CSR_BWC(3)
               | DMA_TCD_CSR_MAJORLINKCH(0u)
               | DMA_TCD_CSR_DONE(0u)
               | DMA_TCD_CSR_MAJORELINK(0u /* off */)
               | DMA_TCD_CSR_ESG(0u)
               | DMA_TCD_CSR_DREQ(1u)
               | DMA_TCD_CSR_INTHALF(0u)
               | DMA_TCD_CSR_INTMAJOR(0u)
               | DMA_TCD_CSR_START(0u),
    };
    
    /** Request our DMA channel from the DMA driver for exclusive use. */
#ifdef DEBUG
    const bool gotDMAChn =
#endif
    dma_osAcquireDMAChannel( &_hDMAChannel
                           , /* idxDMADevice */ 0
                           , DMA_CHN_FOR_SERIAL_OUTPUT
                           , &dmaChnCfg
                           , /* reset */ true
                           );
    /** If this assertion fires, then there is an error in the overall system design. More
        than one client code location want to reserve one and the same DMA channel for
        exclusive use. This error needs to be resolved before the system can startup. */
    assert(gotDMAChn);

    /* Set the load address of source data initially to the beginning of the ring buffer. */
    dma_osSetDMAChannelSourceAddress( &_hDMAChannel
                                    , &_serialOutRingBuf[_serialOutRingBufIdxWrM]
                                    );

    /* Direct Memory Access Multiplexer (DMAMUX), RM, section 71, p. 3563: The DMA is
       triggered to do a minor loop cycle by the data request of some I/O device.
       Unfortunately is the LINFlex device on the DEVKIT-MPC5748G that is connected to the
       USB port not capable of triggering a DMA transfer on buffer empty. We use a dummy
       device instead, "Always on", and control the speed of the data transmission by a
       timer based trigger condition. This technique is restricted to the first two DMA
       channels of each group.
         ENBL: Enable the path from I/O device to DMA channel. RM, 71.4.1, NOTE: The DMA
       channel should first be disabled, then configured.
         TRIG: Enable the gating of the I/O data request with the timer trigger.
         SOURCE: Select the I/O device, "Always on" in our case. The devices are hardwired
       to the DMAMUX and the index of a specific device can be found in table 71-1, RM
       71.1, p. 3563. */
#if DMA_CHN_FOR_SERIAL_OUTPUT >= 0  &&  DMA_CHN_FOR_SERIAL_OUTPUT <= 1
    DMAMUX_0->CHCFG[DMA_CHN_FOR_SERIAL_OUTPUT] =
#elif DMA_CHN_FOR_SERIAL_OUTPUT >= DMAMUX_CHCFG_COUNT \
      &&  DMA_CHN_FOR_SERIAL_OUTPUT <= DMAMUX_CHCFG_COUNT+1
    DMAMUX_1->CHCFG[DMA_CHN_FOR_SERIAL_OUTPUT-DMAMUX_CHCFG_COUNT] =
#else
# error Configuration error: The chosen DMA channel does not permit timer triggering
#endif
    /* DMAMUX_n->CHCFG[] = */   DMAMUX_CHCFG_ENBL(1)
                                | DMAMUX_CHCFG_TRIG(1)
                                | DMAMUX_CHCFG_SOURCE(63);

    /* Enable Request Register (DMA_ERQ), RM 70.3.7: Not touched yet, we don't enable the
       channel yet. This will be done in the next use of sio_osWriteSerial. */
    //dma_osEnableDMAChannelTriggerFromIODevice(&_hDMAChannel, /* enable */ true);

} /* End of configDMA */




/**
 * Initialization of the MPC5748G's I/O device LINFlexDn. The device is put into UART mode
 * for serial in-/output.
 *   @param baudRate
 * The Baud rate in Hz. Allow values range from 10 .. 1000000, proven values range from 300
 * till 256000 Hz. ("Proven" relates to the DEVKIT-MPC5748G connected to a Windows host
 * through openSDA and USB.)
 *   @remark
 * To match the correct Baud rates the code assumes a peripheral clock rate for the LINFlex
 * devices of 80 MHz.
 */
static void configLINFlex(unsigned int baudRate)
{
    /* Avoid over-/underflow down below. */
    if(baudRate < 10)
        baudRate = 10;
    else if(baudRate > 1000000)
        baudRate = 1000000;
    
    /* Please find the UART register description in the MCU ref. manual, section 45.5, p.
       1947ff. */

    /* Enter INIT mode. This is a prerequisite to access the other registers.
       INIT, 0x1: 1 init mode, 0 normal operation or sleep
       SLEEP, 0x2: 1 sleep mode, 0: normal operation */
    LINFLEX->LINCR1 = LINFLEX->LINCR1
                      & ~LINFlexD_LINCR1_SLEEP_MASK
                      | LINFlexD_LINCR1_INIT(0x1);

    /* Wait for acknowledge of the INIT mode. */
    while((LINFLEX->LINSR & LINFlexD_LINSR_LINS_MASK) != LINFlexD_LINSR_LINS(1))
    {}

    /* Configure the LINFlex to operate in UART mode
         The UART bit is set prior to other bits in the same register in
       order to become able to write the other configuration bits. See MCU manual, section
       45.5.5, p. 1988. */
    LINFLEX->UARTCR = LINFlexD_UARTCR_UART(1); /* 0 for UART, 1 for LIN */
    LINFLEX->UARTCR = LINFlexD_UARTCR_RFBM(0) /* RX: 0: Buffer mode, 1: FIFO mode */
                      | LINFlexD_UARTCR_TFBM(0) /* TX: 0: Buffer mode, 1: FIFO mode */
                      | LINFlexD_UARTCR_TDFL_TFC(0) /* Buffer takes n+1 chars per write */
                      | LINFlexD_UARTCR_RDFL_RFC(0) /* Interrupt after n+1 received chars */
                      | LINFlexD_UARTCR_PCE(0) /* 0: Parity off, 1: Parity on */
                      | LINFlexD_UARTCR_WL1(0) /* WL=01b: 8 Bit data */
                      | LINFlexD_UARTCR_WL0(1)
                      | LINFlexD_UARTCR_SBUR(0) /* RX: n+1 stop bits */
                      | LINFlexD_UARTCR_RxEn(1) /* Enable RX */
                      | LINFlexD_UARTCR_TxEn(1) /* Enable TX */
                      | LINFlexD_UARTCR_UART(1); /* Don't loose UART mode bit */
                         
