PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
    /* Configure baudrate:
       LIN_clk is 80 MHz (peripheral clock).
       LFDIV = LIN_clk / (16 * desired baudrate)
       LINIBRR.IBR = integer part of LFDIV
       LINFBRR.FBR = 16 * fractional part of LFDIV (after decimal point)

       Example:
       LFDIV = 80e6/(16*9600) = 520.83
       LINIBRR.IBR = 520
       LINFBRR.FBR = 16*0.83 = 13

       Up to 256000 bd worked well with terminal.exe and putty. 384000 bd failed with
       terminal.exe and putty, which is likely due to the openSDA/USB/COM gateways than
       because of the LINFlex/DMA device of the MCU. */
/// @todo Make use of constants in ccl.h
    const unsigned long LIN_clk = 80000000ul /* Hz */
                      , IBR = (LIN_clk/16u) / baudRate
                      , FBR = ((LIN_clk/16u) - IBR*baudRate)*16 / baudRate;
    assert((IBR & ~0xffffful) == 0  &&  (FBR & ~0xful) == 0);
    LINFLEX->LINIBRR = LINFlexD_LINIBRR_IBR(IBR);
    LINFLEX->LINFBRR = LINFlexD_LINFBRR_FBR(FBR);

    /* Clear all possibly pending status bits by w2c access. RM 45.5.6.
         The documentation is ambiguous how to reset bits DRFRFE and DTFTFF. The figure
       says write the value, the explanation text says write to clear. We assume the
       latter. */
    LINFLEX->UARTSR = 0x0000ffefu;

    /* LINIER: Interrupt enable, RM 45.5.2. The bits relate to the bits of same name in
       LINESR (error bits), LINSR and UARTSR (both status).
         BOIE: Buffer overrun could be read in handling of DBFIE
         DBFIE: should report FIFO full in reception mode
         DBEIETOIE: Should request new data for TX, UARTSR[TO] needs to be set
         DRIE: Interrupt on byte received, DRF set in UARTSR
         DTIE: Interrupt on byte sent, DTF set in UARTSR */
    LINFLEX->LINIER = LINFlexD_LINIER_DRIE(1);
    
    /* Global Control Register (GCR) RM 45.5.21.
         Note: Here, we need to select the same number of stop bits as for RX in
       UARTCR.SBUR.
         @todo For unclear reasons this register cannot be written although LINSR indicates
       that we are in init mode. The CPU runs into a machine check exception and manually
       trying it in the debugger yields a "can't write to memory" error. This problem stays
       unsolved; we anyway need to see the reset default value of the register, which is
       zero. */
#if 0
    LINFLEX->GCR = LINFlexD_GCR_TDFBM(0)   /* TX: 0: normal bit order, 1: MSB first */
                   | LINFlexD_GCR_RDFBM(0) /* RX: 0: normal bit order, 1: MSB first */
                   | LINFlexD_GCR_TDLIS(0) /* TX: 1: Invert all bits */
                   | LINFlexD_GCR_RDLIS(0) /* RX: 1: Invert all bits */
                   | LINFlexD_GCR_STOP(0); /* TX: n+1 stop bits */
#endif

    /* Enter normal mode again. */
    LINFLEX->LINCR1 &= ~LINFlexD_LINCR1_INIT_MASK;
    while((LINFLEX->LINSR & LINFlexD_LINSR_LINS_MASK) != LINFlexD_LINSR_LINS(2))
    {}
    
} /* End of configLINFlex */




/**
 * Interrupt handler for UART RX event. A received character is read from the UART hardware
 * and put into our ring buffer if there's space left. Otherwise the character is counted
 * as lost without further remedial action.
 */
static void linFlexRxInterrupt(void)
{
    /* Get the received byte. */
    /// @todo Record a buffer overrun bit in case the IRQ handler comes too slow
    const unsigned char c = (LINFLEX->BDRM & LINFlexD_BDRM_DATA4_MASK)
                            >> LINFlexD_BDRM_DATA4_SHIFT;
#ifdef DEBUG
    ++ sio_serialInNoRxBytes;
#endif

    /* To support different terminal characteristics, one character can be configured to
       be silently ignored in the input stream. This shall normally be the linefeed
       character. */
#if SERIAL_INPUT_FILTERED_CHAR != 0
    if(c != SERIAL_INPUT_FILTERED_CHAR)
#endif
    {
        /* Check for buffer full. Compute next write position at the same time. */
        volatile uint8_t * const pWrTmp = _pWrSerialInRingBuf
                       , * const pWrNext = pWrTmp < _pEndSerialInRingBuf? pWrTmp+1
                                                                        : &_serialInRingBuf[0];

        /* Put the byte into our buffer if there's enough room. */
        if(pWrNext != _pRdSerialInRingBuf)
        {
            *pWrTmp = c;
        
            /* Count the received end of line characters. (The variable is decremented on
               consumption of such a character.) */
            if(c == SERIAL_INPUT_EOL)
                ++ _serialInNoEOL;

            /* Update write position into ring buffer. This is at the same time the indication
               of the availability of the new character to the application API functions. */
            _pWrSerialInRingBuf = pWrNext;
        }
        else    
        {
            /* Buffer overrun, count lost character. */
            ++ sio_serialInLostBytes;
        }
    
        /* Ensure that all relevant memory changes are visible before we leave the
           interrupt. */
        std_fullMemoryBarrier();
        
    } /* End if(Character discarded?) */

    /* Acknowlege the interrupt by w2c and enable the next one at the same time. */
    assert((LINFLEX->UARTSR & LINFlexD_UARTSR_DRFRFE_MASK) != 0);
    LINFLEX->UARTSR = LINFlexD_UARTSR_DRFRFE_MASK;
    
} /* End of linFlexRxInterrupt */



/**
 * Our locally implemented interrupt handlers are registered at the operating system for
 * serving the required I/O devices (LINFlex).
 */
static void registerInterrupts(void)
{
    /* Interrupt offsets taken from MCU reference manual, see 23.1.2 INTC interrupt
       sources, p. 523ff, Table 23-1. */
#define IDX_LINFLEX_RX_IRQ  (376+3*(IDX_LINFLEX_D))

    /* Register our IRQ handler. */
    rtos_osRegisterInterruptHandler( &linFlexRxInterrupt
                                   , /* processorID */ INTC_IRQ_TARGET_CORE
                                   , /* vectorNum */ IDX_LINFLEX_RX_IRQ
                                   , /* psrPriority */ INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT
                                   , /* isPreemptable */ true
                                   );
#undef IDX_LINFLEX_RX_IRQ
} /* End of registerInterrupts */




/**
 * Initialize the I/O devices for serial output, in particular, these are the LINFlex
 * device plus a DMA channel to serve it. However, to regularly trigger the DMA we still
 * need a PIT timer and to commiunicate with the real world we need two ports from the
 * SIUL2. Finally, the peripheral bridge needs to be configured for granting access rights
 * to the DMA.
 *   @param baudRate
 * The Baud rate of in- and output in Hz. Allow values range from 10 .. 1000000, proven
 * values range from 300 till 115200 Hz.
 *   @remark
 * This function needs to be called at system initialization phase, when all External
 * Interrupts are still suspended.
 */
void sio_osInitSerialInterface(unsigned int baudRate)
{
    /* Grant access to the DMA controller to read from RAM and write to LINFlexD. */
    configPeripheralBridgeForDMA();
    
    /* Connect the LINFlexD_2 device with the external MCU pins so that on the evaluation
       board DEVKIT-MPC5748G communication with the host computer via the openSDA chip and
       the USB connection becomes possible. This step is device dependent and won't work
       with any other LINFlex than 2. */
    configSIULForUseWithOpenSDA();
    
