PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
    /* Configure the LINFlex device for serial in- and output. */
    configLINFlex(baudRate);

    /* Register the interrupt handler serial RX. */
    registerInterrupts();
    
    /* Initialize the PIT timer so that it triggers the DMA at maximum speed for given baud
       rate. */
    configPITAsDMATrigger(baudRate);

    /* Initialize DMA for writing into the UART. */
    configDMA();

    /* Empty receive buffer. */
    _pWrSerialInRingBuf =
    _pRdSerialInRingBuf = &_serialInRingBuf[0];
    
} /* End of sio_osInitSerialInterface */



/** 
 * System call handler for entry into data output. A byte string is sent through the serial
 * interface. Actually, the bytes are queued for sending and the function is non-blocking. 
 *   @return
 * The number of queued bytes is returned. Normally, this is the same value as argument \a
 * noBytes. However, the byte sequence can be longer than the currently available space in
 * the send buffer. (Its size is fixed and no reallocation strategy is implemented.) The
 * tranmitted message will be truncated if the return value is less than function argument
 * \a noBytes.
 *   @param PID
 * The process ID of the calling task.
 *   @param msg
 * The byte sequence to send. Note, this may be but is not necessarily a C string with zero
 * terminations. Zero bytes can be sent, too.
 *   @param noBytes
 * The number of bytes to send. For a C string, this will mostly be \a strlen(msg).
 *   @remark
 * This function must never be called directly. The function is only made for placing it in
 * the global system call table.
 */
unsigned int sio_scFlHdlr_writeSerial( uint32_t PID ATTRIB_UNUSED
                                     , const char *msg
                                     , unsigned int noBytes
                                     )
{
    /* The system call handler gets a pointer to the message to print. We need to validate
       that this pointer, coming from the untrusted user code doesn't break our safety
       concept. A user process may read only from all used ROM and all used RAM. */
    if(!rtos_checkUserCodeReadPtr(msg, noBytes))
    {
        /* The user specified memory region is not entirely inside the permitted,
           accessible range. This is a severe user code error, which is handeld with an
           exception, task abort and counted error. */
        rtos_osSystemCallBadArgument();
    }
    
    /* After checking the potentially bad user input we may delegate it to the "normal"
       function implementation. */
    return sio_osWriteSerial(msg, noBytes);

} /* End of sio_scFlHdlr_writeSerial */
        
        

        
/** 
 * Principal API function for data output. A byte string is sent through the serial
 * interface. Actually, the bytes are queued for sending and the function is
 * non-blocking.\n
 *   The function can be called from any context on any core. However, it must not be
 * called untill function sio_osInitSerialInterface() has completed.
 *   @return
 * The number of queued bytes is returned. Normally, this is the same value as argument \a
 * noBytes. However, the byte sequence can be longer than the currently available space in
 * the send buffer. (Its size is fixed and no reallocation strategy is implemented.) The
 * tranmitted message will be truncated if the return value is less than function argument
 * \a noBytes.
 *   @param msg
 * The byte sequence to send. Note, this may be but is not necessarily a C string with zero
 * terminations. Zero bytes can be send, too.
 *   @param noBytes
 * The number of bytes to send. For a C string, this will mostly be \a strlen(msg).
 *   @remark
 * This function must be called by trusted code in supervisor mode only. It belongs to the
 * sphere of trusted code itself.
 *   @remark
 * The mutual exclusion of different contexts from entering this function is implemented
 * using a locally defined critical section object of type \a
 * mtx_intercoreCriticalSection_t. Such a critical will likely cause a deadlock if
 * intermingled with other critical sections. Therefore, this function must not be called
 * from inside of another intercore critical section. Call from a local critical section
 * implemented by suspension of interrupts is however permitted.
 *   @remark
 * The duration of the execution of the critical section is of order O(noBytes); a memcpy()
 * is applied to copy the message bytes into the output buffer. This can mean a significant
 * long time of suspension of interrupts on the invoking and the other cores. Moreover,
 * there's no fair arbitration and if one core makes frequent use of this function then
 * others may suffer from starvation.
 */
unsigned int sio_osWriteSerial(const char *msg, unsigned int noBytes)
{
    /* Do not interfere with a (possibly) running DMA transfer if we don't really need to
       do anything. */
    if(noBytes == 0)
        return 0;

    /* The manipulation if the output buffer and the DMA registers is done inside a
       critical section, which implements mutual exclusion of all contexts on all cores. So
       any context on any core can safely apply this function. */
    static mtx_intercoreCriticalSection_t DATA_OS(critSec) = MTX_INTERCORE_CRITICAL_SECTION;
    mtx_osEnterIntercoreCriticalSection(&critSec);
    
    /* Stop the (possibly) running DMA channel, then check the current status of a possibly
       pending transfer request from the connected PIT timer device.
         RM 70.5.8.1: Coherently stop a DMA channel with the ability of resuming it later. */
    stopDMATrigger();
    while(dma_osGetDMAChannelPendingTriggerFromIODevice(&_hDMAChannel))
    {}
    dma_osEnableDMAChannelTriggerFromIODevice(&_hDMAChannel, /* enable */ false);

    /* Note, most buffer addresses or indexes in this section of the code are
       understood as cyclic, i.e. modulo the buffer size. This is indicated by an M as
       last character of the affected symbols but not mentioned again in the code
       comments. */
#define MODULO(bufIdx)    ((bufIdx) & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK)

    /* Get the pointer to our DMA channel. */
    dma_dmaTransferCtrlDesc_t * const pTCD = dma_getTransferControlDescriptor(&_hDMAChannel);

    /* The current, i.e. next, transfer address of the DMA is the first (cyclic)
       address, which we must not touch when filling the buffer. This is the (current)
       end of the free buffer area. */
    const uint32_t idxEndOfFreeSpaceM = pTCD->SADDR;

    /* The cyclic character of the buffer can require one or two copy operations to
       place the message. We compute the concrete index ranges to copy.
         Note the -1: Same index values are used as empty-buffer-indication. Therefore
       it is not possible to entirely fill the buffer. */
    const unsigned int noBytesFree =
                            MODULO(idxEndOfFreeSpaceM - _serialOutRingBufIdxWrM - 1);

    /* Avoid buffer overrun by saturation of the user demand and report the number of
       overrun events and the number of lost message characters. */
    if(noBytes > noBytesFree)
    {
        ++ sio_serialOutNoTruncatedMsgs;
        sio_serialOutNoLostMsgBytes += noBytes - noBytesFree;
        noBytes = noBytesFree;
    }

    /* How many bytes would fit until we have to wrap? This limits the first copy
       operation. */
    const unsigned int noBytesTillEnd = MODULO(- _serialOutRingBufIdxWrM);
    unsigned int noBytesAtEnd;
    if(noBytes <= noBytesTillEnd)
    {
        /* The message fits into the rest of the linear buffer, no wrapping required. */
        noBytesAtEnd = noBytes;
    }
    else
    {
        /* A portion of the message is placed at the end of the linear buffer and the
           rest of the message at its beginning. */
        noBytesAtEnd = noBytesTillEnd;
    }

    /* Always copy the first part of the message to the current end of the linear
       buffer. The serial buffer, shared between all accessing cores and DMA, is located in
       uncached memory so that the writes go into main memory, where it can be accessed by
       DMA. */
    uint8_t * const pDest = &_serialOutRingBuf[MODULO(_serialOutRingBufIdxWrM)];
    assert(pDest + noBytesAtEnd <= &_serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE]);
    memcpy(pDest, msg, noBytesAtEnd);

    /* Copy the second part of the message at the beginning of the linear buffer if
       there is a remainder. */
    if(noBytes > noBytesAtEnd)
    {
        assert(noBytes - noBytesAtEnd < sizeof(_serialOutRingBuf));
        memcpy(&_serialOutRingBuf[0], msg+noBytesAtEnd, noBytes-noBytesAtEnd);
    }           

