PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/system/drivers/serial/sio_serialIO.c
    /* Reading the ring buffer is done in a critical section to ensure mutual exclusion
       with the it filling interrupt. */
    uint32_t msr = rtos_osEnterCriticalSection();
    {
        volatile uint8_t * pRd = _pRdSerialInRingBuf;

        /* If no line has been received then we need to double-check that the buffer is not
           entirely full; if so we were stuck: No new characters (i.e. no newline) could
           ever be received and the application would never again get a line of input.
             If we find a full buffer then we consider the entire buffer as a single line
           of input. */
        if(_serialInNoEOL == 0)
        {
            volatile uint8_t * const pWr = _pWrSerialInRingBuf
                           , * const pWrNext = pWr == _pEndSerialInRingBuf
                                               ? &_serialInRingBuf[0]
                                               : pWr + 1;
            if(pWrNext == pRd)
            {

                /* pWr points immediately before pRd: Buffer is currently full. Copy
                   complete contents as a (pseudo-) line of text. */
                unsigned int noBytesToCopy = SERIAL_INPUT_RING_BUFFER_SIZE-1;
                /// @todo Count and report lost characters at least in DEBUG compilation
                if(noBytesToCopy > sizeOfStr)
                    noBytesToCopy = sizeOfStr;

                /* Copy the ring buffer (limited to the requested number of characters).
                   Consider wrapping at the end of the linear area. */
                const unsigned int noBytesTillEnd = (unsigned int)(_pEndSerialInRingBuf - pRd)
                                                    + 1;
                unsigned int noBytesAtEnd;
                if(noBytesTillEnd >= noBytesToCopy)
                {
                    /* The requested number of characters is still found at the end of the
                       ring buffer. */
                    noBytesAtEnd = noBytesToCopy;
                }
                else
                {
                    /* We need to copy a second character sequence from the beginning of
                       the ring buffer into the destination. */
                    noBytesAtEnd = noBytesTillEnd;
                }
                
                assert(noBytesAtEnd <= sizeOfStr);
                memcpy(str, (const uint8_t*)pRd, noBytesAtEnd);
                if(noBytesAtEnd < noBytesToCopy)
                {
                    memcpy( str+noBytesAtEnd
                          , (const uint8_t*)&_serialInRingBuf[0]
                          , noBytesToCopy-noBytesAtEnd
                          );
                }
                
                /* The client code expects a zero terminated C string. */
                str[sizeOfStr] = '\0';

                /* Adjust read pointer such that it represents the empty buffer. */
                _pRdSerialInRingBuf = pWr;
            }
            else
            {
                /* No complete line of text has been read so far. */
                str[0] = '\0';
                result = NULL;
            }
        }
        else
        {
            /* A line of text is available in the buffer. We copy the bytes in naive
               loop instead of using memcpy, since we anyway need such a loop to find the
               next EOL character. */
            while(true)
            {
                /* We can have an empty buffer here, there's at minimum the EOL left. */
                assert(pRd != _pWrSerialInRingBuf);
                
                /* Get next input character. */
                char c = (char)*pRd;
                
                /* Loop termination is the first matching EOL character. */
                if(c == SERIAL_INPUT_EOL)
                {
                    /* Acknowldge consumption of EOL character but do not return the
                       (redundant) EOL character to the application. */
                    -- _serialInNoEOL;
                    
                    /* Advance read pointer: The EOL is consumed by this call of the
                       function. */
                    _pRdSerialInRingBuf = pRd == _pEndSerialInRingBuf? &_serialInRingBuf[0]
                                                                     : pRd + 1;
                    
                    /* End the copy loop. */
                    break;
                }
                
                /* Copy next character only if destination buffer still has room left. We
                   continue to consume the rest of the line if this is not the case. */
                if(sizeOfStr > 0)
                {
                    * pWrApp++ = *pRd;
                    -- sizeOfStr;
                }
                /// @todo else Count and report lost characters at least in DEBUG compilation
                
                /* Cyclically advance read pointer. */
                pRd = pRd == _pEndSerialInRingBuf? &_serialInRingBuf[0]: pRd + 1;
                
            } /* End while(All characters to consume from ring buffer) */
            
            /* Write the terminating zero byte to make the text line a C string. */
            *pWrApp = '\0';
        }
    }
    rtos_osLeaveCriticalSection(msr);

    return result;

} /* End of sio_osGetLine */


